Catalogs/Подъезды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Подъезды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗданияИСооружения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерПервойКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоследнейКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодъезда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суффикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыСооружений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыСооружений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паркинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общежитие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаЗданий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Подъезды/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = НСтр("ru='Улицы';uk='Вулиці'");
		
		Элементы.КоличествоЭтажей.Видимость = Ложь;
		
		Элементы.Наименование.Заголовок = НСтр("ru='Улица';uk='Вулиця'");
		Элементы.Владелец.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		Элементы.НомерПервойКвартиры.Заголовок = НСтр("ru='№ первого коттеджа';uk='№ першого котеджу'");
		Элементы.НомерПоследнейКвартиры.Заголовок = НСтр("ru='№ последнего коттеджа';uk='№ останнього котеджу'");
		
		Элементы.Наименование.Подсказка = НСтр("ru='Улица';uk='Вулиця'");
		Элементы.Владелец.Подсказка = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		Элементы.НомерПервойКвартиры.Подсказка = НСтр("ru='№ первого коттеджа';uk='№ першого котеджу'");
		Элементы.НомерПоследнейКвартиры.Подсказка = НСтр("ru='№ последнего коттеджа';uk='№ останнього котеджу'");
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") Тогда
		
		Если Параметры.Отбор.Свойство("Владелец") Тогда	
			Если Параметры.Отбор.Владелец.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда	
				ЭтаФорма.АвтоЗаголовок = Ложь;
				ЭтаФорма.Заголовок = НСтр("ru='Улицы';uk='Вулиці'");
				
				Элементы.КоличествоЭтажей.Видимость = Ложь;
				
				Элементы.Наименование.Заголовок = НСтр("ru='Улица';uk='Вулиця'");
				Элементы.Владелец.Заголовок = НСтр("ru='Группа зданий (поселок)';uk='Група будівель (селище)'");
				Элементы.НомерПервойКвартиры.Заголовок = НСтр("ru='№ первого коттеджа';uk='№ першого котеджу'");
				Элементы.НомерПоследнейКвартиры.Заголовок = НСтр("ru='№ последнего коттеджа';uk='№ останнього котеджу'");
				
				Элементы.Наименование.Подсказка = НСтр("ru='Улица';uk='Вулиця'");
				Элементы.Владелец.Подсказка = НСтр("ru='Группа зданий (поселок)';uk='Група будівель (селище)'");
				Элементы.НомерПервойКвартиры.Подсказка = НСтр("ru='№ первого коттеджа';uk='№ першого котеджу'");
				Элементы.НомерПоследнейКвартиры.Подсказка = НСтр("ru='№ последнего коттеджа';uk='№ останнього котеджу'");
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
